# ElectricalDemandFactorValue Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalDemandFactorValue Constructor
ElectricalDemandFactorValue Class See Also
---
Default constructor. Initializes factor to 1.0 or 100%. Min and max range are set to 0.0
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElectricalDemandFactorValue()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ElectricalDemandFactorValue()
```

# See Also
ElectricalDemandFactorValue Class
ElectricalDemandFactorValue Overload
Autodesk.Revit.DB.Electrical Namespace